app/controllers/books_controller.rb

  def create
  	  @book = Book.new(book_params)
  if  @book.save
      flash[:notice] = 'Book was successfully created.'
  	  redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "テスト"], ["body", "てすと"], ["created_at", "2020-01-15 05:24:56.231104"], ["updated_at", "2020-01-15 05:24:56.231104"]]
SELECT "books".* FROM "books"

  def update
      book = Book.find(params[:id])
  if  book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "aa"], ["updated_at", "2020-01-15 07:21:56.199770"], ["id", 14]]